{
  "<PAD>": 0,
  "<BOS>": 1,
  "<EOS>": 2,
  "<UNK>": 3,
  "IIIIIIIIIIIIXXZYYIII": 4,
  "IIIIIIIIIIIIXXZZZXZX": 5,
  "IIIIIIIIIIIXZZZZXIII": 6,
  "IIIIIIIIIIXZZYZZYZZX": 7,
  "IIIIIIIIXZZZZYZZXZYI": 8,
  "IIIIIIIIYZZXZZZYZXII": 9,
  "IIIIIIIXZZXZZZZZZYZY": 10,
  "IIIIIIIYZYZZZZZZXZXI": 11,
  "IIIIIIIYZZZZXZZZXZZY": 12,
  "IIIIIIXZYZZZZZZZZYZX": 13,
  "IIIIIIYXZZXZZYII": 14,
  "IIIIIIYZZZZZZXZZYXII": 15,
  "IIIIIXYZZZZXYIII": 16,
  "IIIIXXZZZZZYYI": 17,
  "IIIIXXZZZZZYZZZY": 18,
  "IIIIXYZZYZXI": 19,
  "IIIIXYZZZZYX": 20,
  "IIIIXZYZXZZZYIII": 21,
  "IIIIXZZZZZXZZZYZZZZY": 22,
  "IIIIYZZZZZYI": 23,
  "IIIXXZZYZYII": 24,
  "IIIXXZZZYYII": 25,
  "IIIXYZYZZXIIII": 26,
  "IIIXYZZZZZZZZZZYZZXI": 27,
  "IIIXZXZXZZZX": 28,
  "IIIXZXZZZZXX": 29,
  "IIIXZYXZZYII": 30,
  "IIIXZZYZZZZYZXII": 31,
  "IIIXZZYZZZZYZZXI": 32,
  "IIIXZZZXIIIIIIIIIIIIII": 33,
  "IIIXZZZXYZYIIIII": 34,
  "IIIXZZZZZZYZZZZXZZZY": 35,
  "IIIXZZZZZZZX": 36,
  "IIIYXZZZZZYXII": 37,
  "IIIYZXZYXIIIII": 38,
  "IIIYZZZYIIIIII": 39,
  "IIXXZYZZZZZZZYIIIIIIII": 40,
  "IIXXZZZXZZZX": 41,
  "IIXYZZZYZZZZXI": 42,
  "IIXYZZZZXZZZYIIIIIIIII": 43,
  "IIXZXZZZZZYY": 44,
  "IIXZXZZZZZYZZY": 45,
  "IIXZYZZZZXYI": 46,
  "IIXZZXIIIIII": 47,
  "IIXZZXZZZYYIIIII": 48,
  "IIXZZYYZZXIIII": 49,
  "IIXZZYZXYIII": 50,
  "IIXZZYZZZXYI": 51,
  "IIXZZZZXXZZZZXII": 52,
  "IIYXZZXZZYII": 53,
  "IIYXZZYZZZXI": 54,
  "IIYXZZZZYZXIIIII": 55,
  "IIYXZZZZZYXI": 56,
  "IIYXZZZZZYZZXIIIIIIIII": 57,
  "IIYYZZXZXIIIII": 58,
  "IIYYZZZXZZZXIIIIIIIIII": 59,
  "IIYZXZXZYIIIII": 60,
  "IIYZXZZZYZXI": 61,
  "IIYZXZZZZZZYZXII": 62,
  "IIYZXZZZZZZZZZZZXZYI": 63,
  "IIYZYZXZZZZX": 64,
  "IIYZZYXZZZZX": 65,
  "IIYZZYZYZYIIII": 66,
  "IIYZZYZZYZZZYI": 67,
  "IIYZZZZZZZZYZZZZXZZX": 68,
  "IXXI": 69,
  "IXXZZZYZZZZZZZZZZZZZYI": 70,
  "IXYZZZYZZZXI": 71,
  "IXYZZZZZZXZY": 72,
  "IXZXZYZZZZZZZZZZZZZYII": 73,
  "IXZXZZYYIIII": 74,
  "IXZXZZZYZZZZZZZZZZZZZY": 75,
  "IXZXZZZZZZYY": 76,
  "IXZYYZZZXIII": 77,
  "IXZYZXZZZZZY": 78,
  "IXZYZZXYIIII": 79,
  "IXZYZZYZZZXI": 80,
  "IXZYZZZZYXII": 81,
  "IXZZXZXXIIII": 82,
  "IXZZXZZZZXZX": 83,
  "IXZZXZZZZYYI": 84,
  "IXZZYZZZZZXY": 85,
  "IXZZZXZYZYIIII": 86,
  "IXZZZXZZZYZZZY": 87,
  "IXZZZYXZYIII": 88,
  "IXZZZYXZZZZY": 89,
  "IXZZZZZYZXZZZZYI": 90,
  "IYXZZZYZZZXI": 91,
  "IYXZZZZZZZXZZZZZZZYIII": 92,
  "IYYZZZZYZZZY": 93,
  "IYYZZZZZZYZZZZYI": 94,
  "IYYZZZZZZZZZZZZYZZZYII": 95,
  "IYZXZZZXZZZY": 96,
  "IYZYZZZZXZZZZZZXIIIIII": 97,
  "IYZZZYXXIIII": 98,
  "IYZZZZZZZXZZZZZXYIII": 99,
  "XXXX": 100,
  "XXYY": 101,
  "XXZZZZZYZYII": 102,
  "XXZZZZZZZZXZZZZZZZZZZX": 103,
  "XYXY": 104,
  "XYYX": 105,
  "XYZZXZZZYIII": 106,
  "XZXI": 107,
  "XZXZZZXZZZXI": 108,
  "XZXZZZYZZZYIII": 109,
  "XZXZZZZZXZXI": 110,
  "XZYZZZZXZZYI": 111,
  "XZYZZZZZZXYIIIII": 112,
  "XZYZZZZZZZZXYIIIIIIIII": 113,
  "XZZX": 114,
  "XZZXXXIIIIII": 115,
  "XZZXZZYYIIII": 116,
  "XZZXZZZZZYZY": 117,
  "XZZYZZZZZZZZZZZXZZYIII": 118,
  "XZZYZZZZZZZZZZZYXIIIII": 119,
  "XZZYZZZZZZZZZZZZZZXZZY": 120,
  "XZZZXZYZYIII": 121,
  "XZZZYZXZZZZY": 122,
  "XZZZYZYZXIIIII": 123,
  "XZZZYZZXZYII": 124,
  "XZZZYZZYZZZX": 125,
  "XZZZYZZZYZZZZZZX": 126,
  "XZZZZXZZZXZZZZXI": 127,
  "XZZZZXZZZZZZZZYZZZZY": 128,
  "XZZZZZXZYZZZZYII": 129,
  "XZZZZZZZZXIIII": 130,
  "YXZZYZXIIIIIIIIIIIIIII": 131,
  "YXZZZZYXIIII": 132,
  "YXZZZZZZYZZZXIII": 133,
  "YXZZZZZZZXYI": 134,
  "YXZZZZZZZYZZZZXI": 135,
  "YXZZZZZZZZZZXZZZZZZYII": 136,
  "YZXZZZZZYZZZXI": 137,
  "YZYI": 138,
  "YZYZXZZZZZZZZZZZZXIIII": 139,
  "YZYZZZZXZZZX": 140,
  "YZYZZZZZZYZZZZZYIIIIII": 141,
  "YZYZZZZZZZZZZZZZZXXI": 142,
  "YZZYZXZZZXII": 143,
  "YZZYZZYZZZZY": 144,
  "YZZYZZZZYZZY": 145,
  "YZZZXZZZZZYXII": 146,
  "YZZZYZYZZZZZZY": 147,
  "YZZZZYZXXIII": 148
}