{
  "<PAD>": 0,
  "<BOS>": 1,
  "<EOS>": 2,
  "<UNK>": 3,
  "IIIIIIIIIIIIIZIIIIII": 4,
  "IIIIIIIIIIIIXXZYYIII": 5,
  "IIIIIIIIIIIIXXZZZXZX": 6,
  "IIIIIIIIIIIIZI": 7,
  "IIIIIIIIIIIIZZ": 8,
  "IIIIIIIIIIIXZZZZXIII": 9,
  "IIIIIIIIIIIZ": 10,
  "IIIIIIIIIIIZII": 11,
  "IIIIIIIIIIIZIIIIIIII": 12,
  "IIIIIIIIIIXZZYZZYZZX": 13,
  "IIIIIIIIIIZI": 14,
  "IIIIIIIIIIZIII": 15,
  "IIIIIIIIIIZZ": 16,
  "IIIIIIIIIZII": 17,
  "IIIIIIIIIZIIII": 18,
  "IIIIIIIIIZIIZI": 19,
  "IIIIIIIIIZZI": 20,
  "IIIIIIIIXZZZZYZZXZYI": 21,
  "IIIIIIIIYZZXZZZYZXII": 22,
  "IIIIIIIIZIII": 23,
  "IIIIIIIIZIIZ": 24,
  "IIIIIIIIZZII": 25,
  "IIIIIIIXZZXZZZZZZYZY": 26,
  "IIIIIIIYZYZZZZZZXZXI": 27,
  "IIIIIIIYZZZZXZZZXZZY": 28,
  "IIIIIIIZ": 29,
  "IIIIIIIZIIII": 30,
  "IIIIIIIZIIIIII": 31,
  "IIIIIIIZIIIIIIIIIIII": 32,
  "IIIIIIIZIIZI": 33,
  "IIIIIIIZIZIIII": 34,
  "IIIIIIXZYZZZZZZZZYZX": 35,
  "IIIIIIYXZZXZZYII": 36,
  "IIIIIIYZZZZZZXZZYXII": 37,
  "IIIIIIZI": 38,
  "IIIIIIZIIIIIII": 39,
  "IIIIIIZIIIIIIIIIIIII": 40,
  "IIIIIIZIIIZI": 41,
  "IIIIIIZIIZII": 42,
  "IIIIIIZIZIIIII": 43,
  "IIIIIIZZ": 44,
  "IIIIIIZZIIII": 45,
  "IIIIIXYZZZZXYIII": 46,
  "IIIIIZII": 47,
  "IIIIIZIIIIII": 48,
  "IIIIIZIIIIIIII": 49,
  "IIIIIZIIIIIIIIIIIIII": 50,
  "IIIIIZIIIIIZ": 51,
  "IIIIIZIIIIZI": 52,
  "IIIIIZIZ": 53,
  "IIIIIZZI": 54,
  "IIIIIZZIIIII": 55,
  "IIIIXXYY": 56,
  "IIIIXXZZZZZYYI": 57,
  "IIIIXXZZZZZYZZZY": 58,
  "IIIIXYZZYZXI": 59,
  "IIIIXYZZZZYX": 60,
  "IIIIXZYZXZZZYIII": 61,
  "IIIIXZZZZZXZZZYZZZZY": 62,
  "IIIIYZZZZZYI": 63,
  "IIIIZIII": 64,
  "IIIIZIIIIIII": 65,
  "IIIIZIIIIIIIII": 66,
  "IIIIZIIIIIIZ": 67,
  "IIIIZIIZ": 68,
  "IIIIZIZI": 69,
  "IIIIZZII": 70,
  "IIIIZZIIIIII": 71,
  "IIIXXZZYZYII": 72,
  "IIIXXZZZYYII": 73,
  "IIIXYZYZZXIIII": 74,
  "IIIXYZZZZZZZZZZYZZXI": 75,
  "IIIXZXZXZZZX": 76,
  "IIIXZXZZZZXX": 77,
  "IIIXZYXZZYII": 78,
  "IIIXZZYZZZZYZXII": 79,
  "IIIXZZYZZZZYZZXI": 80,
  "IIIXZZZXIIIIIIIIIIIIII": 81,
  "IIIXZZZXYZYIIIII": 82,
  "IIIXZZZZZZYZZZZXZZZY": 83,
  "IIIXZZZZZZZX": 84,
  "IIIYIYII": 85,
  "IIIYIYIIIIII": 86,
  "IIIYXZZZZZYXII": 87,
  "IIIYZXZYXIIIII": 88,
  "IIIYZZZYIIIIII": 89,
  "IIIZ": 90,
  "IIIZIIII": 91,
  "IIIZIIIIIIII": 92,
  "IIIZIIIIIIIIIIIIZIII": 93,
  "IIIZIIIIIIZI": 94,
  "IIIZIIIZ": 95,
  "IIIZIIZI": 96,
  "IIIZIIZIIIII": 97,
  "IIIZZIII": 98,
  "IIXXIIYY": 99,
  "IIXXYYII": 100,
  "IIXXZYZZZZZZZYIIIIIIII": 101,
  "IIXXZZZXZZZX": 102,
  "IIXYIIYX": 103,
  "IIXYYXII": 104,
  "IIXYZZZYZZZZXI": 105,
  "IIXYZZZZXZZZYIIIIIIIII": 106,
  "IIXZXZZZZZYY": 107,
  "IIXZXZZZZZYZZY": 108,
  "IIXZYZZZZXYI": 109,
  "IIXZZXIIIIII": 110,
  "IIXZZXZZZYYIIIII": 111,
  "IIXZZYYZZXIIII": 112,
  "IIXZZYZXYIII": 113,
  "IIXZZYZZZXYI": 114,
  "IIXZZZZXXZZZZXII": 115,
  "IIYXXYII": 116,
  "IIYXZZXZZYII": 117,
  "IIYXZZYZZZXI": 118,
  "IIYXZZZZYZXIIIII": 119,
  "IIYXZZZZZYXI": 120,
  "IIYXZZZZZYZZXIIIIIIIII": 121,
  "IIYYZZXZXIIIII": 122,
  "IIYYZZZXZZZXIIIIIIIIII": 123,
  "IIYZXZXZYIIIII": 124,
  "IIYZXZZZYZXI": 125,
  "IIYZXZZZZZZYZXII": 126,
  "IIYZXZZZZZZZZZZZXZYI": 127,
  "IIYZYIII": 128,
  "IIYZYIIIIIIYZY": 129,
  "IIYZYZXZZZZX": 130,
  "IIYZZYIIIIIYYI": 131,
  "IIYZZYXZZZZX": 132,
  "IIYZZYZYZYIIII": 133,
  "IIYZZYZZYZZZYI": 134,
  "IIYZZZZZZZZYZZZZXZZX": 135,
  "IIZI": 136,
  "IIZIIIII": 137,
  "IIZIIIIIIIIIIIIIIZII": 138,
  "IIZIIIIIIIIZ": 139,
  "IIZIIIIIIZII": 140,
  "IIZIIIIZ": 141,
  "IIZIIIZI": 142,
  "IIZIIZII": 143,
  "IIZIZIIIIIIIIIIIIIII": 144,
  "IIZXZXII": 145,
  "IIZZ": 146,
  "IIZZIIII": 147,
  "IIZZIIIIIIII": 148,
  "IIZZIIIIIIIIIIIIIIII": 149,
  "IXXI": 150,
  "IXXZZZYZZZZZZZZZZZZZYI": 151,
  "IXYZZZYZZZXI": 152,
  "IXYZZZZZZXZY": 153,
  "IXZXZYZZZZZZZZZZZZZYII": 154,
  "IXZXZZYYIIII": 155,
  "IXZXZZZYZZZZZZZZZZZZZY": 156,
  "IXZXZZZZZZYY": 157,
  "IXZYYZZZXIII": 158,
  "IXZYZXZZZZZY": 159,
  "IXZYZZXYIIII": 160,
  "IXZYZZYZZZXI": 161,
  "IXZYZZZZYXII": 162,
  "IXZZXZXXIIII": 163,
  "IXZZXZZZZXZX": 164,
  "IXZZXZZZZYYI": 165,
  "IXZZYZZZZZXY": 166,
  "IXZZZXZYZYIIII": 167,
  "IXZZZXZZZYZZZY": 168,
  "IXZZZYXZYIII": 169,
  "IXZZZYXZZZZY": 170,
  "IXZZZZZYZXZZZZYI": 171,
  "IYIYIIIIIIIIII": 172,
  "IYXZZZYZZZXI": 173,
  "IYXZZZZZZZXZZZZZZZYIII": 174,
  "IYYIIIIIIIIIYY": 175,
  "IYYIYYIIIIIIII": 176,
  "IYYZZZZYZZZY": 177,
  "IYYZZZZZZYZZZZYI": 178,
  "IYYZZZZZZZZZZZZYZZZYII": 179,
  "IYZXZZZXZZZY": 180,
  "IYZYIIIIIIIIII": 181,
  "IYZYZZZZXZZZZZZXIIIIII": 182,
  "IYZZZYXXIIII": 183,
  "IYZZZZZZZXZZZZZXYIII": 184,
  "IZII": 185,
  "IZIIIIII": 186,
  "IZIIIIIIIIII": 187,
  "IZIIIIIIIIIIII": 188,
  "IZIIIIIIIIIIIIIIIIII": 189,
  "IZIIIIIIIIIIIIIIIZII": 190,
  "IZIIIIIIIIIIIIIZIIII": 191,
  "IZIIIIIIIIIIIZ": 192,
  "IZIIIIIIIIIIZI": 193,
  "IZIIIIIIIIIZ": 194,
  "IZIIIIIIIZII": 195,
  "IZIIIIIIIZIIII": 196,
  "IZIIIIIIZIII": 197,
  "IZIIIIIIZIIIII": 198,
  "IZIIIIIZ": 199,
  "IZIIIIIZIIII": 200,
  "IZIIIIIZIIIIII": 201,
  "IZIIIIZI": 202,
  "IZIIIIZIIIII": 203,
  "IZIIIIZIIIIIII": 204,
  "IZIIIZII": 205,
  "IZIIIZIIIIII": 206,
  "IZIIZIII": 207,
  "IZIIZIIIIIIIII": 208,
  "IZIXZXII": 209,
  "IZIZ": 210,
  "IZXZXIII": 211,
  "IZZI": 212,
  "IZZIIIII": 213,
  "IZZIIIIIIIII": 214,
  "IZZIIIIIIIIIII": 215,
  "IZZIIIIIIIIIIIIIIIII": 216,
  "XXXX": 217,
  "XXYY": 218,
  "XXYYIIII": 219,
  "XXYZZYII": 220,
  "XXZZZZZYZYII": 221,
  "XXZZZZZZZZXZZZZZZZZZZX": 222,
  "XYIIIIYX": 223,
  "XYIYXIII": 224,
  "XYXY": 225,
  "XYYX": 226,
  "XYYXIIII": 227,
  "XYZZXZZZYIII": 228,
  "XZXI": 229,
  "XZXZZZXZZZXI": 230,
  "XZXZZZYZZZYIII": 231,
  "XZXZZZZZXZXI": 232,
  "XZYZZZZXZZYI": 233,
  "XZYZZZZZZXYIIIII": 234,
  "XZYZZZZZZZZXYIIIIIIIII": 235,
  "XZZX": 236,
  "XZZXXXIIIIII": 237,
  "XZZXZZYYIIII": 238,
  "XZZXZZZZZYZY": 239,
  "XZZYZZZZZZZZZZZXZZYIII": 240,
  "XZZYZZZZZZZZZZZYXIIIII": 241,
  "XZZYZZZZZZZZZZZZZZXZZY": 242,
  "XZZZXZYZYIII": 243,
  "XZZZYZXZZZZY": 244,
  "XZZZYZYZXIIIII": 245,
  "XZZZYZZXZYII": 246,
  "XZZZYZZYZZZX": 247,
  "XZZZYZZZYZZZZZZX": 248,
  "XZZZZXZZZXZZZZXI": 249,
  "XZZZZXZZZZZZZZYZZZZY": 250,
  "XZZZZZXZYZZZZYII": 251,
  "XZZZZZZZZXIIII": 252,
  "YXIIIIXY": 253,
  "YXIIXYII": 254,
  "YXIXYIII": 255,
  "YXXY": 256,
  "YXXYIIII": 257,
  "YXZZYZXIIIIIIIIIIIIIII": 258,
  "YXZZZZYXIIII": 259,
  "YXZZZZZZYZZZXIII": 260,
  "YXZZZZZZZXYI": 261,
  "YXZZZZZZZYZZZZXI": 262,
  "YXZZZZZZZZZZXZZZZZZYII": 263,
  "YYIIIIXX": 264,
  "YYIYYIII": 265,
  "YYXX": 266,
  "YYXXIIII": 267,
  "YZXZZZZZYZZZXI": 268,
  "YZYI": 269,
  "YZYZXZZZZZZZZZZZZXIIII": 270,
  "YZYZZZZXZZZX": 271,
  "YZYZZZZZZYZZZZZYIIIIII": 272,
  "YZYZZZZZZZZZZZZZZXXI": 273,
  "YZZYZXZZZXII": 274,
  "YZZYZZYZZZZY": 275,
  "YZZYZZZZYZZY": 276,
  "YZZZXZZZZZYXII": 277,
  "YZZZYZYZZZZZZY": 278,
  "YZZZZYZXXIII": 279,
  "ZIII": 280,
  "ZIIIIIII": 281,
  "ZIIIIIIIIIII": 282,
  "ZIIIIIIIIIIIII": 283,
  "ZIIIIIIIIIIIIIIIIIII": 284,
  "ZIIIIIIIIIIIIIIZIIII": 285,
  "ZIIIIIIIIIIIIZ": 286,
  "ZIIIIIIIIIIIZI": 287,
  "ZIIIIIIIIIIZ": 288,
  "ZIIIIIIIIZII": 289,
  "ZIIIIIIIIZIIII": 290,
  "ZIIIIIIIZIII": 291,
  "ZIIIIIIIZIIIII": 292,
  "ZIIIIIIZ": 293,
  "ZIIIIIIZIIII": 294,
  "ZIIIIIZI": 295,
  "ZIIIIIZIIIII": 296,
  "ZIIIIIZIIIIIII": 297,
  "ZIIIIZII": 298,
  "ZIIIIZIIIIII": 299,
  "ZIIIIZIIIIIIII": 300,
  "ZIIIIZIIIIIIIIIIIIII": 301,
  "ZIIIZIII": 302,
  "ZIIIZIIIIIII": 303,
  "ZIIIZIIIIIIIIIIIIIII": 304,
  "ZIIZ": 305,
  "ZIIZIIII": 306,
  "ZIIZIIIIIIII": 307,
  "ZIIZIIIIIIIIII": 308,
  "ZIYZYIII": 309,
  "ZIZI": 310,
  "ZIZIIIII": 311,
  "ZIZIIIIIIIIIII": 312,
  "ZZII": 313,
  "ZZIIIIII": 314,
  "ZZIIIIIIIIII": 315,
  "ZZIIIIIIIIIIII": 316
}